lvx/base/DataProcessors/бит_Служебный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_Служебный</Name>
			<Comment>Не используется в конфигурации.</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НастройкаВнешнихПодключений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_НастройкиВнешнихПодключений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверитьСПрефиксомБит</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверитьСправочники</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверитьДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверитьПланыВидовХарактеристик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверитьПланыОбмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверитьПланыСчетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверитьПланыВидовРасчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверитьПроцессы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиПодключений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРасположения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяБазы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Путь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПути</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеПрочитаны</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеАнализировать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

lvx/base/DataProcessors/бит_Служебный/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Планы обмена.
	ЗаИсключениемОбъектовНачинающихсяНа = "бит_"; // АПК:445 Служебный префикс, не являющийся нелокализованной строкой.
	
	// Проверка открытия форм.
	СписокКоллекций.Добавить("Справочники", "Справочники");
	СписокКоллекций.Добавить("Документы", "Документы");
	СписокКоллекций.Добавить("Отчеты", "Отчеты");
	СписокКоллекций.Добавить("Обработки", "Обработки");
	СписокКоллекций.Добавить("ПланыВидовХарактеристик", "Планы видов характеристик");
	СписокКоллекций.Добавить("ПланыСчетов", "Планы счетов");
	СписокКоллекций.Добавить("РегистрыСведений", "Регистры сведений");
	СписокКоллекций.Добавить("РегистрыНакопления", "Регистры накопления");
	СписокКоллекций.Добавить("РегистрыБухгалтерии", "Регистры бухгалтерии");
    СписокКоллекций.ЗаполнитьПометки(Истина);
	
	// Тест записи объектов.
	Объект.Префикс = "бит_" ; // АПК:445 Служебный префикс, не являющийся нелокализованной строкой.
	Объект.ПроверитьСправочники = Истина;
	Объект.ПроверитьДокументы = Истина;
	Объект.ПроверитьПланыВидовРасчета = Истина;
	Объект.ПроверитьПланыВидовХарактеристик = Истина;
	Объект.ПроверитьПланыОбмена = Истина;
	Объект.ПроверитьПланыСчетов = Истина;
	Объект.ПроверитьПроцессы = Истина;
	// АПК:445-выкл наименования объектов метаданных.
	ПланОбменаИсточник = "Полный";
	ПланОбменаПриемник = "бит_Полный";
	// АПК:445-вкл
		
	ОтражениеЗарплатыВБухучете = "< не выполнено >";

	РежимРаботы = 1;
	
	Показывать = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"ИнтернетПоддержкаПользователей",
		"ВсегдаПоказыватьПриСтартеПрограммы", Истина);
	
	Если бит_ОбщегоНазначения.ЭтоБП() Тогда
		ДатаТекущейВерсии = Константы.ДатаТекущейВерсии.Получить();
	Иначе
		Элементы.ДатаТекущейВерсии.Видимость = Ложь;
	КонецЕсли; 
	
	УправлениеФормой(ЭтотОбъект);
	
	// Проверка сортировки.
	УстановитьИнформациюОбОшибках(Элементы.ПроверкаСортировки_ИнфоОбОшибках);
	
	ВосстановитьНастройки();
	УстановитьУсловноеОформление();
	
	// Проверка регистраторов.
	// АПК:1297-выкл
	ПутьКПапке = "\\project-ds713\ProjectsData\БИТ.ФИНАНС\2. РабочиеМатериалы\Обработки\Проверка сборки\ФайлыПроверок";
	// АПК:1297-вкл
	ФайлРегистраторов = ПолучитьИмяФайлаРегистраторов(БфТип);
		
КонецПроцедуры

&НаСервере
Процедура ПередЗакрытиемНаСервере()
	
	КлючОбъекта  = "СравнениеМетаданныхКонфигураций";
    КлючНастроек = "НастройкиПодключений";
    Настройки    = Объект.НастройкиПодключений.Выгрузить();
	Настройки.ЗаполнитьЗначения(Ложь, "ДанныеПрочитаны");
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта,  КлючНастроек, Настройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ПередЗакрытиемНаСервере();
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РежимРаботыПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьПриИзменении(Элемент)
	ПоказыватьПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаТекущейВерсииПриИзменении(Элемент)
	ДатаТекущейВерсииПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура АнализироватьРолиПриИзменении(Элемент)
	
	Для каждого СтрокаНастройки Из Объект.НастройкиПодключений Цикл
		СтрокаНастройки.ДанныеПрочитаны = Ложь;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиПодключений

&НаКлиенте
Процедура НастройкиПодключенийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	Оповещение = Новый ОписаниеОповещения("ИзменениеНастройкиПодключенияЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.бит_Служебный.Форма.НастройкаПодключения",,ЭтотОбъект,,,,
		Оповещение,РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры
	
&НаКлиенте
Процедура НастройкиПодключенийПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.НастройкиПодключений.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отказ                = Истина;
	
	СтруктураПодключения = Новый Структура;
	СтруктураПодключения.Вставить("ИД"               , ТекущиеДанные.ИД);
	СтруктураПодключения.Вставить("Наименование"     , ТекущиеДанные.Наименование);
	СтруктураПодключения.Вставить("ПредставлениеПути", ТекущиеДанные.ПредставлениеПути);
	СтруктураПодключения.Вставить("ТипРасположения"  , ТекущиеДанные.ТипРасположения);
	СтруктураПодключения.Вставить("ИмяСервера"       , ТекущиеДанные.ИмяСервера);
	СтруктураПодключения.Вставить("ИмяБазы"          , ТекущиеДанные.ИмяБазы);
	СтруктураПодключения.Вставить("Путь"             , ТекущиеДанные.Путь);
	СтруктураПодключения.Вставить("Пользователь"     , ТекущиеДанные.Пользователь);
	СтруктураПодключения.Вставить("НеАнализировать"  , ТекущиеДанные.НеАнализировать);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СтруктураПодключения", СтруктураПодключения);
	
	Оповещение = Новый ОписаниеОповещения("ИзменениеНастройкиПодключенияЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.бит_Служебный.Форма.НастройкаПодключения",ПараметрыФормы,ЭтотОбъект,,,,
		Оповещение,РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры
	
// Окончание редактирования окна "НастройкаПодключения".
//
&НаКлиенте
Процедура ИзменениеНастройкиПодключенияЗавершение(РезультатыНастроек, ДополнительныеПараметры) Экспорт
	
	Если РезультатыНастроек = Неопределено
		ИЛИ РезультатыНастроек = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиИД = Объект.НастройкиПодключений.НайтиСтроки(Новый Структура("ИД", РезультатыНастроек.ИД));
	Если СтрокиИД.Количество() = 0 Тогда
		СтрокаНастройки = Объект.НастройкиПодключений.Добавить();
	Иначе
		СтрокаНастройки = СтрокиИД[0];
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(СтрокаНастройки, РезультатыНастроек);
	СтрокаНастройки.ДанныеПрочитаны = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРегистраторыДляСравнения

&НаКлиенте
Процедура РегистраторыДляСравненияЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	СписокВидовОбъектов = Новый СписокЗначений;
	ВидОбъектаРегистрБухгалтерии = ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.РегистрБухгалтерии");
	ВидОбъектаРегистрСведений    = ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.РегистрСведений");
	ВидОбъектаРегистрНакопления  = ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.РегистрНакопления");
	СписокВидовОбъектов.Добавить(ВидОбъектаРегистрБухгалтерии);
	СписокВидовОбъектов.Добавить(ВидОбъектаРегистрСведений);
	СписокВидовОбъектов.Добавить(ВидОбъектаРегистрНакопления);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидыОбъектов"           , СписокВидовОбъектов);
	// Недоделано: ПараметрыФормы.Вставить("ТекущийОбъектСистемы"   , );
	ОткрытьФорму("ОбщаяФорма.бит_ФормаВыбораОбъектовСистемы", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РегистраторыДляСравненияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если РегистраторыДляСравнения.Количество() = 2 Тогда
		Отказ = Истина;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ПроверкаРегистраторов

&НаКлиенте
Процедура ПроверитьРегистраторы(Команда)
	ПроверитьРегистраторыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверитьРегистраторыНаСервере()
	
	Обработки.бит_Служебный.ПроверитьРегистраторы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаСоставныхТипов

&НаКлиенте
Процедура ПроверкаСоставныхТипов(Команда)
	ПроверкаСоставныхТиповНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверкаСоставныхТиповНаСервере()
	
	Элементы.ДекорацияОпасность.Видимость = Обработки.бит_Служебный.ПроверкаСоставныхТипов(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СоответствиеРегистраторовХозрасчетный

&НаКлиенте
Процедура РегистраторыХозрасчетный(Команда)
	ЗаполнитьТаблицуРегистраторовХозрасчетныйСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуРегистраторовХозрасчетныйСервер()
	
	Обработки.бит_Служебный.ЗаполнитьТаблицуРегистраторовХозрасчетный(ЭтотОбъект);
	
КонецПроцедуры //ЗаполнитьТаблицуРегистраторовХозрасчетныйСервер()

#КонецОбласти 

#Область СоответствиеРегистраторовМеждународный

&НаКлиенте
Процедура РегистраторыМеждународный(Команда)
	ЗаполнитьТаблицуРегистраторовМеждународныйСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуРегистраторовМеждународныйСервер()
	
	Обработки.бит_Служебный.ЗаполнитьТаблицуРегистраторовМеждународный(ЭтотОбъект);
	
КонецПроцедуры //ЗаполнитьТаблицуРегистраторовХозрасчетныйСервер()

#КонецОбласти 

#Область СоответствиеРегистраторовХозрасчетныйПВХ

&НаКлиенте
Процедура ЗаполнитьПВХ(Команда)
	ЗаполнитьТаблицуПВХСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПВХСервер()

	Обработки.бит_Служебный.ЗаполнитьТаблицуПВХ(ЭтотОбъект);
	
КонецПроцедуры // ЗаполнитьТаблицуПВХСервер()

#КонецОбласти 

#Область ПолучениеКонтрольныхСумм

&НаКлиенте
Процедура ПолучитьКонтрольныеСуммы(Команда)
	ПолучитьКонтрольныеСуммыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьКонтрольныеСуммыНаСервере()
	
	Обработки.бит_Служебный.ПолучитьКонтрольныеСуммы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти 

#Область СортировкаМетаданных

&НаКлиенте
Процедура СформироватьСпискиПроверкиСортировки(Команда)
	
	СформироватьТаблицыМетаданныхСервер();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьИнформациюОбОшибках(ТекЭлемент, ЕстьПроверка = Ложь, ЕстьОшибки = Ложь)

	ТекЭлемент.Видимость = ЕстьПроверка;
	Если ЕстьОшибки Тогда
		ТекЭлемент.Заголовок = НСтр("ru = 'Есть ошибки!'; en = 'There are mistakes!'");
		ТекЭлемент.ЦветТекста = WebЦвета.Красный;
	Иначе	
	    ТекЭлемент.Заголовок = НСтр("ru = 'Ошибок нет'; en = 'No errors'");
		ТекЭлемент.ЦветТекста = WebЦвета.Зеленый;
	КонецЕсли;  	

КонецПроцедуры // УстановитьИнформациюОбОшибках()

&НаСервере
Процедура СформироватьТаблицыМетаданныхСервер()

	Обработки.бит_Служебный.СформироватьТаблицыМетаданных(ЭтотОбъект);
	УстановитьИнформациюОбОшибках(Элементы.ПроверкаСортировки_ИнфоОбОшибках, Истина, ЕстьОшибки);
	
КонецПроцедуры // СформироватьТаблицыМетаданныхСервер()

#КонецОбласти

#Область СоответствиеПлановОбмена

&НаКлиенте
Процедура СоответствиеПлановОбмена(Команда)
	
	ПолучитьСоставПланаОбменаСервер();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСоставПланаОбменаСервер()

	ПротоколПланОбмена = "";
	Обработки.бит_Служебный.ПолучитьСоставПланаОбмена(ПланОбменаИсточник, ПланОбменаПриемник, ЗаИсключениемОбъектовНачинающихсяНа, ПротоколПланОбмена);

КонецПроцедуры // ПолучитьСоставПланаОбменаСервер()

&НаКлиенте
Процедура ПланОбменаИсточникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	пСписокВыбора = ПланыОбмена();
	
	Оповещение = Новый ОписаниеОповещения("ПланОбменаИсточникОкончаниеВыбора", ЭтотОбъект); 
	пСписокВыбора.ПоказатьВыборЭлемента(Оповещение);
	
КонецПроцедуры

&НаКлиенте 
Процедура ПланОбменаИсточникОкончаниеВыбора(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если НЕ ВыбранноеЗначение = Неопределено Тогда
		
		ПланОбменаИсточник = ВыбранноеЗначение.Значение;
		
	КонецЕсли;
	
КонецПроцедуры // ПланОбменаИсточникОкончаниеВыбора()

&НаКлиенте
Процедура ПланОбменаПриемникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	пСписокВыбора = ПланыОбмена();
	
	Оповещение = Новый ОписаниеОповещения("ПланОбменаПриемникОкончаниеВыбора", ЭтотОбъект); 
	пСписокВыбора.ПоказатьВыборЭлемента(Оповещение);
	
КонецПроцедуры

&НаКлиенте 
Процедура ПланОбменаПриемникОкончаниеВыбора(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если НЕ ВыбранноеЗначение = Неопределено Тогда
		
		ПланОбменаПриемник = ВыбранноеЗначение.Значение;
		
	КонецЕсли;
	
КонецПроцедуры // ПланОбменаПриемникОкончаниеВыбора()

&НаСервереБезКонтекста
Функция ПланыОбмена()
	
	МетаПланыОбмена = Метаданные.ПланыОбмена;
	
	пСписокВыбора = Новый СписокЗначений;
	
	Для Каждого ПланОбмена Из МетаПланыОбмена Цикл
		
		пСписокВыбора.Добавить(ПланОбмена.Имя, ПланОбмена.Синоним);
		
	КонецЦикла;
	
	Возврат пСписокВыбора;
	
КонецФункции

#КонецОбласти

#Область ПроверкаОткрытияФорм

&НаКлиенте
Процедура ДокументРезультатОткрытиеФормОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = 0;
	ОткрытьФорму(Расшифровка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиПротоколТестаНаОткрытиеФорм(ДокументРезультат, Ошибки)

	Макет = Обработки.бит_Служебный.ПолучитьМакет("ОткрытиеФорм");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	СтрокаОшибка = Макет.ПолучитьОбласть("СтрокаОшибка");
	СтрокаИтог 	 = Макет.ПолучитьОбласть("СтрокаИтог");
	
	ДокументРезультат.Очистить();
	ДокументРезультат.Вывести(ОбластьШапка);
	Для каждого Элемент Из Ошибки Цикл
		СтрокаОшибка.Параметры.Заполнить(Элемент);
		ДокументРезультат.Вывести(СтрокаОшибка);
	КонецЦикла; 
	
	Если Ошибки.Количество() = 0 Тогда
		ДокументРезультат.Вывести(СтрокаИтог);
	КонецЕсли; 

КонецПроцедуры
 
&НаКлиенте
Процедура ТестНаОткрытиеФорм(Команда)
	
	Перем Формы;
	Перем Объекты;

	ТестНаОткрытиеФормНачалоНаСервере(Объекты, Формы);
	
	Классы = Новый Соответствие;
	Классы.Вставить("Справочники", "Справочник");
	Классы.Вставить("Документы", "Документ");
	Классы.Вставить("Отчеты", "Отчет");
	Классы.Вставить("Обработки", "Обработка");
	Классы.Вставить("ПланыВидовХарактеристик", "ПланВидовХарактеристик");
	Классы.Вставить("ПланыСчетов", "ПланСчетов");
	Классы.Вставить("РегистрыСведений", "РегистрСведений");
	Классы.Вставить("РегистрыНакопления", "РегистрНакопления");
	Классы.Вставить("РегистрыБухгалтерии", "РегистрБухгалтерии");
	
	ИмяФормыШаблон       = НСтр("ru = '%1.%2.%3'; en = '%1.%2.%3'");
	Шаблонсообщения      = НСтр("ru = 'Открывается форма %1 из %2'; en = 'Form opens %1 from %2'");
	ШаблонПояснения      = НСтр("ru = 'Форма %1'; en = 'The form %1'");
	ШаблонОписанияОшибки = НСтр("ru = '!!!: Ошибка открытия формы ""%1"": %2'; 
								|en = '!!!: Error opening form ""%1"": %2'");
	
	ПараметрыПередачи = Новый Структура(); 
	ПараметрыПередачи.Вставить("АвтоТест",              РежимТестирования = 0); // АПК: 1339 Механизм тестирования открытия форм.
	ПараметрыПередачи.Вставить("АвтотестЛицензирование",НЕ РежимТестирования = 0);
	
	Ошибки = Новый Массив; 
	Для каждого ЭлементСписка Из СписокКоллекций Цикл
		
		Если НЕ ЭлементСписка.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		ТекИмяКоллекции           = ЭлементСписка.Значение;
		ТекстИмяДляПолученияФормы = Классы.Получить(ТекИмяКоллекции);
		
		МассивИменФорм     = Формы.Получить(ТекИмяКоллекции);
		МассивИменОбъектов = Объекты.Получить(ТекИмяКоллекции);
		
		Если ЗначениеЗаполнено(МассивИменОбъектов) Тогда
			
			Ном = 1;
			КолОбъектов = МассивИменОбъектов.КОличество();
			
			Для каждого ТекИмяОбъекта Из МассивИменОбъектов Цикл
				Если ТекИмяОбъекта = "бит_Служебный"
					ИЛИ ТекИмяОбъекта = "бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию"
					ИЛИ ТекИмяОбъекта = "бит_ОтражениеФактаДДС"
					ИЛИ СтрЗаканчиваетсяНа(ТекИмяОбъекта, "ПрисоединенныеФайлы") Тогда
					// Служебные и устаревшие объекты.
					Продолжить;
				КонецЕсли;
				
				Для каждого ТекИмяФормы Из МассивИменФорм Цикл
					ТекИмяФормы    = СтрШаблон(ИмяФормыШаблон, ТекстИмяДляПолученияФормы, ТекИмяОбъекта, ТекИмяФормы);
					ТекстСообщения = СтрШаблон(Шаблонсообщения, Ном, КолОбъектов);
					ТекстПояснения = СтрШаблон(ШаблонПояснения, ТекИмяФормы);

					Состояние(ТекстСообщения, Цел(Ном * 100 / КолОбъектов), ТекстПояснения);
					Попытка 
						ФормаОбъекта = ОткрытьФорму(ТекИмяФормы, ПараметрыПередачи);
						Если НЕ ФормаОбъекта = Неопределено И ФормаОбъекта.Открыта() Тогда
						     ФормаОбъекта.Закрыть(Неопределено);
						КонецЕсли; 
					Исключение						
						ПараметрыСтроки = Новый Структура;
						ПараметрыСтроки.Вставить("Форма", ТекИмяФормы);
						ПараметрыСтроки.Вставить("ОписаниеОшибки", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
						Ошибки.Добавить(ПараметрыСтроки);
					КонецПопытки;
				КонецЦикла;
				
				Ном = Ном + 1;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	ВывестиПротоколТестаНаОткрытиеФорм(ДокументРезультатОткрытиеФорм, Ошибки);
	
	Состояние("");	
	ПоказатьОповещениеПользователя(НСтр("ru='Проверка закончена';en='Verification completed'"));
	
КонецПроцедуры

&НаСервере
Процедура ТестНаОткрытиеФормНачалоНаСервере(Объекты, Формы)

	Объекты = Обработки.бит_Служебный.ИменаОбъектов(СписокКоллекций);
	Формы   = Обработки.бит_Служебный.ИменаФорм();
	                  	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсе(Команда)
	
	// Установить пометку у всех строк.
    СписокКоллекций.ЗаполнитьПометки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	// Снять пометку у всех строк.
    СписокКоллекций.ЗаполнитьПометки(Ложь);
	
КонецПроцедуры

#КонецОбласти 

#Область ТестЗаписиОбъектов

&НаСервере
Процедура ПоставитьФлажкиСервер()
	
	Объект.ПроверитьСправочники = Истина;
	Объект.ПроверитьДокументы = Истина;
	Объект.ПроверитьПланыВидовРасчета = Истина;
	Объект.ПроверитьПланыВидовХарактеристик = Истина;
	Объект.ПроверитьПланыОбмена = Истина;
	Объект.ПроверитьПланыСчетов = Истина;
	Объект.ПроверитьПроцессы = Истина;

КонецПроцедуры // ПоставитьФлажкиСервер()

&НаСервере
Процедура СнятьФлажкиСервер()

	Объект.ПроверитьСправочники = Ложь;
	Объект.ПроверитьДокументы = Ложь;
	Объект.ПроверитьПланыВидовРасчета = Ложь;
	Объект.ПроверитьПланыВидовХарактеристик = Ложь;
	Объект.ПроверитьПланыОбмена = Ложь;
	Объект.ПроверитьПланыСчетов = Ложь;
	Объект.ПроверитьПроцессы = Ложь;

КонецПроцедуры // СнятьФлажкиСервер()

&НаСервере
Процедура ИнвертироватьФлажкиСервер()

	Объект.ПроверитьСправочники = НЕ Объект.ПроверитьСправочники;
	Объект.ПроверитьДокументы = НЕ Объект.ПроверитьДокументы;
	Объект.ПроверитьПланыВидовРасчета = НЕ Объект.ПроверитьПланыВидовРасчета;
	Объект.ПроверитьПланыВидовХарактеристик = НЕ Объект.ПроверитьПланыВидовХарактеристик;
	Объект.ПроверитьПланыОбмена = НЕ Объект.ПроверитьПланыОбмена;
	Объект.ПроверитьПланыСчетов = НЕ Объект.ПроверитьПланыСчетов;
	Объект.ПроверитьПроцессы = НЕ Объект.ПроверитьПроцессы;

КонецПроцедуры // ИнвертироватьФлажкиСервер()

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьСообщение(Протокол, Сообщение)
	
	Протокол = Протокол+?(ПустаяСтрока(Протокол),"",Символы.ПС)+Сообщение;	
       
КонецПроцедуры // ДобавитьСообщение()

&НаКлиенте
Процедура ПроверитьСПрефиксомБитПриИзменении(Элемент)
	
	 Если Объект.ПроверитьСПрефиксомБит Тогда
	 
	 	  Элементы.Префикс.Доступность = Истина;
		  
	 Иначе
		  
	 	  Элементы.Префикс.Доступность = Ложь;
		                          
	 КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПротоколПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ДанныеСобытия.Href)	Тогда
		СтандартнаяОбработка = Ложь;
		Ссылка = Сред(ДанныеСобытия.Href, СтрНайти(ДанныеСобытия.Href, "e1cib/"));
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(Ссылка);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоставитьФлажки(Команда)
	ПоставитьФлажкиСервер();
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	СнятьФлажкиСервер();	
КонецПроцедуры

&НаКлиенте
Процедура ИнвертироватьФлажки(Команда)
	ИнвертироватьФлажкиСервер();
КонецПроцедуры

&НаКлиенте
Процедура КомандаТестировать(Команда)
	
	ТекущаяДата = ТекущаяДатаНаСервере();
	
	Протокол = "";
	
	ТекстСообщения = НСтр("ru = '<html><body><h1>Начало выполнения %1</h1><i>';
						  |en = '<html><body><h1>Start of execution %1</h1><i>'");
	ТекстСообщения = СтрШаблон(ТекстСообщения, ТекущаяДата);
	ДобавитьСообщение(ПротоколЗаписиОбъектов, ТекстСообщения);
	
	ВызватьМетодОбъекта();
	
	ТекстСообщения = НСтр("ru = '</i><h2>Выполнение завершено %1</h2></body></html>';
						  |en = '</i><h2>Completion complete %1</h2></body></html>'");
	ТекстСообщения = СтрШаблон(ТекстСообщения, ТекущаяДата);
	ДобавитьСообщение(ПротоколЗаписиОбъектов, ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Процедура ВызватьМетодОбъекта()

	СтрПар = Новый Структура;
	СтрПар.Вставить("ПроверитьСПрефиксом", Объект.ПроверитьСПрефиксомБит);
	СтрПар.Вставить("Префикс", Объект.Префикс);
	СтрПар.Вставить("Справочники", Объект.ПроверитьСправочники);
	СтрПар.Вставить("Документы", Объект.ПроверитьДокументы);
	СтрПар.Вставить("ПланыВидовХарактеристик", Объект.ПроверитьПланыВидовХарактеристик);
	СтрПар.Вставить("ПланыОбмена", Объект.ПроверитьПланыОбмена);
	СтрПар.Вставить("ПланыСчетов", Объект.ПроверитьПланыСчетов);
	СтрПар.Вставить("ПланыВидовРасчета", Объект.ПроверитьПланыВидовРасчета);
	СтрПар.Вставить("Процессы", Объект.ПроверитьПроцессы);
	
	ОбОбъект = РеквизитФормыВЗначение("Объект");
	
	РезСтр = ОбОбъект.ПереборМетаданных(СтрПар);
	
	Счетчик = -1;
	Для Счетчик = Счетчик + 1 По РезСтр.МассивРезультатовПроверки.Количество() - 1 Цикл
		
		ТекстСообщения = НСтр("ru = 'ОШИБКА. В объекте метаданных: <font = ""15""><b>%4</font></br>%5</b> <a href=""%1"">%2</a></br>По причине: %3</br>-------------------------------</br>';
						      |en = 'ОШИБКА. В объекте метаданных: <font = ""15""><b>%4</font></br>%5</b> <a href=""%1"">%2</a></br>По причине: %3</br>-------------------------------</br>'");
		ТекстСообщения = СтрШаблон(ТекстСообщения
		, РезСтр.МассивРезультатовПроверки[Счетчик].Элемент
		, РезСтр.МассивРезультатовПроверки[Счетчик].Название
		, РезСтр.МассивРезультатовПроверки[Счетчик].Ошибка
		, РезСтр.МассивРезультатовПроверки[Счетчик].МетаОбъект
		, РезСтр.МассивРезультатовПроверки[Счетчик].Текст);
		ДобавитьСообщение(ПротоколЗаписиОбъектов, ТекстСообщения);
		
	КонецЦикла;	
	
КонецПроцедуры // ВызватьМетодОбъекта()

#КонецОбласти 

#Область СброситьБлокировкуСВнешнимиРесурсами

&НаКлиенте
Процедура СброситьБлокировкуСВнешнимиРесурсами(Команда)
	
	СброситьБлокировкуСВнешнимиРесурсамиСервер();
	
	ТекстСообщения = НСтр("ru='Разблокировано.';en='Unlocked.'");
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Процедура СброситьБлокировкуСВнешнимиРесурсамиСервер()
	
	Обработки.бит_Служебный.СброситьБлокировкуСВнешнимиРесурсами();
	
КонецПроцедуры // СброситьБлокировкуСВнешнимиРесурсамиСервер()
	
#КонецОбласти 

#Область ИзмененныеСвойстваОбъектов

&НаСервереБезКонтекста
Процедура ПроверитьСвойстваОбъектовМДНаСервере(ОтражениеЗарплатыВБухучете)
	
	ОтражениеЗарплатыВБухучете = Обработки.бит_Служебный.ПроверитьСвойстваОбъектовМДНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтражениеЗарплатыВБухучетеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПроверитьСвойстваОбъектовМДНаСервере(ОтражениеЗарплатыВБухучете);
	
КонецПроцедуры

#КонецОбласти 

#Область ПроверкаТиповыхПеречислений

&НаСервере
Процедура ПроверкаТиповыхПеречисленийНаСервере()

	Элементы.ДекорацияОпасность.Видимость = Обработки.бит_Служебный.ПроверкаТиповыхПеречислений(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаТиповыхПеречислений(Команда)
	ПроверкаТиповыхПеречисленийНаСервере();
КонецПроцедуры

#КонецОбласти 

#Область ИнтернетПоддержка

&НаСервере
Процедура ПоказыватьПриИзмененииНаСервере()
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		"ИнтернетПоддержкаПользователей", 
		"ВсегдаПоказыватьПриСтартеПрограммы", Показывать);
	
КонецПроцедуры

&НаСервере
Процедура ДатаТекущейВерсииПриИзмененииНаСервере()
	
	Константы.ДатаТекущейВерсии.Установить(ДатаТекущейВерсии);
	
КонецПроцедуры
	
#КонецОбласти 

#Область ЦентрУправленияИзменениями
	
&НаКлиенте
Процедура ИзменитьНастройки(Команда)
	
	ИзменитьНастройкиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьАлгоритмыПроцессов(Команда)
	
	СоздатьАлгоритмыПроцессовНаСервере();
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.бит_АлгоритмыПроцессов"));
	ОповеститьОбИзменении(Тип("СправочникСсылка.бит_ТочкиАлгоритмов"));
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьНастройкиНаСервере()
	
	Константы.ИспользоватьАльтернативныйСерверДляЗагрузкиКурсовВалют.Установить(Истина);
	ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Установлена возможность использования альтернативного сервера для загрузки валют.'"));
    	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		"ИнтернетПоддержкаПользователей", 
		"ВсегдаПоказыватьПриСтартеПрограммы", Ложь);    
    ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Отменено отображение формы интернет поддержки при открытии приложения.'; 
				  |en = 'The display of the online support form when opening the application has been canceled.'"));

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьАлгоритмыПроцессовНаСервере()
	
	Обработки.бит_Служебный.СозданиеАлгоритмовПроцессов();
	
КонецПроцедуры

#КонецОбласти

#Область СравнениеРегистраторов

&НаКлиенте
Процедура СравнитьРегистраторы(Команда)
	
	СравнитьРегистраторыНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаРегистраторов

&НаКлиенте
Процедура ПроверкаРегистраторов_СформироватьЧистый(Команда)
	
	ПроверкаРегистраторовСформировать(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаРегистраторов_СформироватьСравнить(Команда)
	
	ПроверкаРегистраторовСформировать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаРегистраторов_ЗаписатьРегистраторыВФайл(Команда)
	
	Если ПроверкаРегистраторов_ЕстьОшибки Тогда
	 	ТекстСообщения = НСтр("ru = 'В списке регистраторов есть ошибки. Сформируйте чистый список.'; 
					  		  |en = 'There are errors in the list of registrars. Create a clean list.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПутьКФайлу = ПолучитьПутьКФайлуРегистраторов();	
	Если ЭтотФайлСуществует(ПутьКФайлу) Тогда
	 	УдалитьФайлы(ПутьКФайлу);
	КонецЕсли;
		
	ФайлРег = Новый ЗаписьТекста(ПутьКФайлу, КодировкаТекста.ANSI, , Истина);
	
	КореньДерева = ПроверкаРегистраторов_Результат.ПолучитьЭлементы();
	Для каждого СтрДок Из КореньДерева Цикл
		ИмяДок = СтрДок.Документ;
		Если Лев(ИмяДок, 4) = "бит_" Тогда
		 	Продолжить;		
		КонецЕсли; 	
		ВеткаДерева = СтрДок.ПолучитьЭлементы();
        Для каждого СтрРег Из ВеткаДерева Цикл
            СтрокаВЗапись = ИмяДок + "." + СтрРег.ИмяРегистра + "." + СтрРег.ТипРегистра + Символы.ПС; 
            СтрокаВЗапись = СтрЗаменить(СтрокаВЗапись, "Давальц", "Довальц");
            СтрокаВЗапись = СтрЗаменить(СтрокаВЗапись, "Данны", "Донны");
			ФайлРег.Записать(СтрокаВЗапись);
		КонецЦикла;
	КонецЦикла;

	ФайлРег.Закрыть();  	
	
КонецПроцедуры // ПроверкаРегистраторов_ЗаписатьРегистраторыВФайл()

#КонецОбласти

&НаСервере
Процедура ПрочитатьМетаданныеКонфигурацииНаСервере()
	
	НастройкиПодключения         = Объект.НастройкиПодключений.Выгрузить();
	
	ПараметрыПолученияМетаданных = Новый Структура;
	ПараметрыПолученияМетаданных.Вставить("НастройкиПодключения", НастройкиПодключения);
	ПараметрыПолученияМетаданных.Вставить("АнализироватьРоли", АнализироватьРоли);
	ПараметрыПолученияМетаданных.Вставить("АдресСтруктурыТаблицХранения", АдресСтруктурыТаблицХранения);
	ПараметрыПолученияМетаданных.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	
	РезультатЗагрузки            = ОбработкаОбъект().СтруктураТаблицКонфигураций(ПараметрыПолученияМетаданных);
	АдресСтруктурыТаблицХранения = РезультатЗагрузки.АдресСтруктурыТаблицХранения;
	                                                                  	
	Для каждого ИД Из РезультатЗагрузки.ИДЗагруженныхСтруктурБД Цикл
		СтрокаПодключения = НастройкиПодключения.Найти(ИД, "ИД");
		СтрокаПодключения.ДанныеПрочитаны = Истина;
	КонецЦикла;
	
	Объект.НастройкиПодключений.Загрузить(НастройкиПодключения);
	
	// Настройка компоновщика.
	Если НЕ ЭтоАдресВременногоХранилища(АдресСтруктурыТаблицХранения) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураТаблиц = ПолучитьИзВременногоХранилища(АдресСтруктурыТаблицХранения);
	Если СтруктураТаблиц.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивИД = Новый Массив;
	ТаблицаМетаданных  = СводнаяТаблицаМетаданных(СтруктураТаблиц, МассивИД);
	АдресТаблицыДанных = ПоместитьВоВременноеХранилище(ТаблицаМетаданных, УникальныйИдентификатор);
		
	Схема = РеквизитФормыВЗначение("Объект").ПолучитьМакет("СхемаКомпоновкиДанных");
	ПоляНабораДанных = Схема.НаборыДанных.ТаблицаМетаданных.Поля;
	
	Для каждого ИД Из МассивИД Цикл
		ПолеНабора = ПоляНабораДанных.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		ПолеНабора.Заголовок   = "Найдено в: " + НаименованиеИБ(ИД);
	    ПолеНабора.ПутьКДанным = ПолеПризнакВхождения(ИД);
	    ПолеНабора.Поле        = ПолеПризнакВхождения(ИД);
		ПолеНабора.ТипЗначения = Новый ОписаниеТипов("Булево");
	КонецЦикла;
	
	НастройкиКомпоновкиДанных = Схема.НастройкиПоУмолчанию;
	Для каждого ИД Из МассивИД Цикл
		ВыбранноеПоле = НастройкиКомпоновкиДанных.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Заголовок     = "Найдено в: " + НаименованиеИБ(ИД);
		ВыбранноеПоле.Использование = Истина;
		ВыбранноеПоле.Поле          = Новый ПолеКомпоновкиДанных(ПолеПризнакВхождения(ИД));
	КонецЦикла;
	
	СхемаКомпоновкиДанных = ПоместитьВоВременноеХранилище(Схема, УникальныйИдентификатор);
	Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	Компоновщик.ЗагрузитьНастройки(НастройкиКомпоновкиДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьМетаданныеКонфигурации(Команда)
	
	ПрочитатьМетаданныеКонфигурацииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	СформироватьОтчетНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьАналитики(Команда)
	ПроверитьАналитикиНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СравнениеРегистраторов
	
&НаСервере
Процедура СравнитьРегистраторыНаСервере()
	
	ИменаРегистров = Новый Массив;
	МетаданныеРегистры = Новый Массив;
	Для каждого ЭлементРегистратор Из РегистраторыДляСравнения Цикл
		ОбъектСистемы = ЭлементРегистратор.Значение;	
		ВидОбъекта = ОбъектСистемы.Родитель.ИмяПредопределенныхДанных;
		ИмяОбъекта = ОбъектСистемы.ИмяОбъекта;
		ЭлементМетаданных = Метаданные[ВидОбъекта][ИмяОбъекта];
		ИменаРегистров.Добавить(ОбъектСистемы.ИмяОбъекта);
		МетаданныеРегистры.Добавить(ЭлементМетаданных);
	КонецЦикла;
	
	Если ИменаРегистров.Количество() < 2 Тогда
		ТекстСообщения = НСтр("ru='Заполните два регистра.';en='Fill in two registers.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Элементы.РезультатСравненияРегистраторовЕстьВПервом.Заголовок  = ИменаРегистров[0];
	Элементы.РезультатСравненияРегистраторовЕстьВоВтором.Заголовок = ИменаРегистров[1];
	
	Для каждого ЭлементДокумент Из Метаданные.Документы Цикл
		ЕстьВПервом = ЭлементДокумент.Движения.Содержит(МетаданныеРегистры[0]);
		ЕстьВоВтором = ЭлементДокумент.Движения.Содержит(МетаданныеРегистры[1]);
		Если ЕстьВПервом Или ЕстьВоВтором Тогда		
			НоваяСтрока = РезультатСравненияРегистраторов.Добавить();
			НоваяСтрока.Регистратор = ЭлементДокумент.Синоним;
			// Есть в регистрах.
			НоваяСтрока.ЕстьВПервом = ЕстьВПервом;
			НоваяСтрока.ЕстьВоВтором = ЕстьВоВтором;
			НоваяСтрока.ЕстьВОбоих = ЕстьВПервом И ЕстьВоВтором;		
		КонецЕсли;			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаРегистраторов

&НаКлиентеНаСервереБезКонтекста
Функция ЭтотФайлСуществует(ПутьКФайлу)

	ФайлНаДиске = Новый Файл(ПутьКФайлу);
	
	Возврат ФайлНаДиске.Существует();

КонецФункции // ЭтотФайлСуществует()
 
&НаСервере
Процедура ПроверкаРегистраторовСформировать(СравнитьСФайлом)
	
	ПроверкаРегистраторов_ЕстьОшибки  = Ложь;
	
	КореньДерева = ПроверкаРегистраторов_Результат.ПолучитьЭлементы();
	КореньДерева.Очистить();
		
	ЗаполнитьДеревоПроверкаРегистраторов(СравнитьСФайлом);
	
	УстановитьИнформациюОбОшибках(Элементы.ПроверкаРегистраторов_ИнфоОбОшибках, СравнитьСФайлом, ПроверкаРегистраторов_ЕстьОшибки);
			
КонецПроцедуры // ПроверкаРегистраторовСформировать()

// Работа с файлами

&НаСервере
Функция ПолучитьПутьКФайлуРегистраторов()

	ПутьКФайлу = ПутьКПапке + "\" + ФайлРегистраторов;
	
	Возврат ПутьКФайлу;

КонецФункции // ПолучитьПутьКФайлуРегистраторов()

&НаСервереБезКонтекста
Функция ПолучитьИмяФайлаРегистраторов(БфТип)

	МетаВерсия = Метаданные.Версия;
	НомерВерсии = Лев(МетаВерсия, 3);
	лФайлРегистратора = "Registrars" + СтрЗаменить(Метаданные.Имя, "_БИТ_ФИНАНС", "") 
		+ СтрЗаменить(НомерВерсии, ".", "_") + ?(БфТип = 0, "", "_Типовые") + ".txt";
	
	Возврат лФайлРегистратора;

КонецФункции // ПолучитьИмяФайлаРегистраторов()

&НаСервере
Функция ПрочитатьРегистраторыИзФайла(СравнитьСФайлом)

	фТаблица = Новый ТаблицаЗначений;
	ОпТипСтрока = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100));
	фТаблица.Колонки.Добавить("ИмяДокумента", ОпТипСтрока);
	фТаблица.Колонки.Добавить("ИмяРегистра" , ОпТипСтрока);
	фТаблица.Колонки.Добавить("ТипРегистра" , ОпТипСтрока);
	
	Если СравнитьСФайлом Тогда
		
		// Прочитать из файла  таблицу значений
		ПутьКФайлу = ПолучитьПутьКФайлуРегистраторов();
		Если ЭтотФайлСуществует(ПутьКФайлу) Тогда
			
			ФайлРег = Новый ЧтениеТекста(ПутьКФайлу, КодировкаТекста.ANSI, , Истина);	

			фСтр = ФайлРег.ПрочитатьСтроку();
			Пока фСтр <> Неопределено Цикл // строки читаются до символа перевода строки
                
                фСтр = СтрЗаменить(фСтр, "Довальц", "Давальц");
                фСтр = СтрЗаменить(фСтр, "Донны", "Данны");
                
                МассивСтр = РазобратьСтрокуСРазделителями(фСтр, ".");
				СтрТз = фТаблица.Добавить();
                
                ЕстьОшибка = Ложь;
                Попытка
                    Если МассивСтр.Количество()<3 Тогда
                        ТекстСообщения = НСтр("ru = 'Ошибка в строке:'; en = 'Line error:'") + Символы.НПП + фСтр;
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, ЕстьОшибка);
                    КонецЕсли;                
                Исключение
                     ТекстСообщения = НСтр("ru = 'Ошибка в строке:'; en = 'Line error:'") + Символы.НПП + фСтр;
					 ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, ЕстьОшибка);
                КонецПопытки;
                
                Если ЕстьОшибка Тогда
                    СтрТз.ИмяДокумента = фСтр;
                Иначе
                    СтрТз.ИмяДокумента = МассивСтр[0];// СтрЗаменить(МассивСтр[0], "Довальц", "Давальц");
				    СтрТз.ИмяРегистра  = МассивСтр[1];
				    СтрТз.ТипРегистра  = МассивСтр[2];               
                КонецЕсли;				
                
				// Следующая строка
			    фСтр = ФайлРег.ПрочитатьСтроку();                
                
			КонецЦикла;
		
		КонецЕсли;
	
	КонецЕсли;

	Возврат фТаблица;

КонецФункции // ПрочитатьРегистраторыИзФайла()

&НаСервере
Процедура ЗаполнитьДеревоПроверкаРегистраторов(СравнитьСФайлом)
	
	ТаблицаРегистраторовИзФайла = ПрочитатьРегистраторыИзФайла(СравнитьСФайлом);
    	
#Область ЗаполнениеТаблицыДокументовИзКонфигурации

	ОпТипСтрока = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100));
	ТаблицаДвиженийБит = Новый ТаблицаЗначений;
	ТаблицаДвиженийБит.Колонки.Добавить("ИмяДокумента", ОпТипСтрока);
	ТаблицаДвиженийБит.Колонки.Добавить("ИмяРегистра" , ОпТипСтрока);
	ТаблицаДвиженийБит.Колонки.Добавить("ТипРегистра" , ОпТипСтрока);

	Для каждого МетаДок Из Метаданные.Документы Цикл
		
		ИмяДокумента = МетаДок.Имя;
        Если Лев(ИмяДокумента, 4) = "бит_" Тогда
            Продолжить;		
		КонецЕсли;		     
		
		Для каждого ДвижениеДок Из МетаДок.Движения Цикл
			
			// Формирование таблицы регистраторов для сортировки
            Если (БфТип = 0 И Лев(ДвижениеДок.Имя, 4) = "бит_") 
                ИЛИ (БфТип = 1 И Лев(ДвижениеДок.Имя, 4) <> "бит_") Тогда
				
				НоваяСтрока = ТаблицаДвиженийБит.Добавить();
				
				НоваяСтрока.ИмяДокумента = ИмяДокумента;
				НоваяСтрока.ИмяРегистра  = ДвижениеДок.Имя;
				
				ПолноеИмя = ДвижениеДок.ПолноеИмя();
				НоваяСтрока.ТипРегистра = Лев(ПолноеИмя, Найти(ПолноеИмя, ".") - 1);
							
			КонецЕсли;			
						
		КонецЦикла;
		
	КонецЦикла;
	
#КонецОбласти
	
#Область Запрос	
	
	Запрос = Новый Запрос;
	МенеджерВремТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВремТаблиц;
	Запрос.УстановитьПараметр("ТабКонф", ТаблицаДвиженийБит);
	Запрос.УстановитьПараметр("ТабФайл", ТаблицаРегистраторовИзФайла);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТабКонф.ИмяДокумента КАК ИмяДокумента,
	|	ТабКонф.ИмяРегистра  КАК ИмяРегистра,
	|	ТабКонф.ТипРегистра  КАК ТипРегистра
	|ПОМЕСТИТЬ ВремТабКонф  
	|ИЗ
	|	&ТабКонф КАК ТабКонф
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////     
	|ВЫБРАТЬ
	|	ТабФайл.ИмяДокумента,
	|	ТабФайл.ИмяРегистра,
	|	ТабФайл.ТипРегистра
	|ПОМЕСТИТЬ ВремТабФайл
	|ИЗ 
	|	&ТабФайл КАК ТабФайл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабКонф.ИмяДокумента,
	|	ТабКонф.ИмяРегистра,
	|	ТабКонф.ТипРегистра,
	|	ИСТИНА 				 КАК ЕстьВКонфе,
	|	ЛОЖЬ 				 КАК ЕстьВФайле
	|ПОМЕСТИТЬ ВремТаб  
	|ИЗ
	|	ВремТабКонф КАК ТабКонф
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	ТабФайл.ИмяДокумента,
	|	ТабФайл.ИмяРегистра,
	|	ТабФайл.ТипРегистра,
	|	ЛОЖЬ,
	|	ИСТИНА
	|ИЗ 
	|	ВремТабФайл КАК ТабФайл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТаб.ИмяДокумента КАК ИмяДокумента,
	|	ВремТаб.ИмяРегистра  КАК ИмяРегистра,
	|	ВремТаб.ТипРегистра  КАК ТипРегистра,
	|	ВремТаб.ЕстьВКонфе   КАК ЕстьВКонфе,
	|	ВремТаб.ЕстьВФайле   КАК ЕстьВФайле
	|ИЗ
	|	ВремТаб КАК ВремТаб
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИмяДокумента,
	|	ТипРегистра,
	|	ИмяРегистра
	|ИТОГИ
	|	МАКСИМУМ(ТипРегистра),
	|	МАКСИМУМ(ЕстьВКонфе),
	|	МАКСИМУМ(ЕстьВФайле)
	|ПО
	|	ИмяДокумента,
	|	ИмяРегистра
	|";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
#КонецОбласти 
    
	ВыборкаДок = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Пока ВыборкаДок.Следующий() Цикл
        
        ВеткаДерева = Неопределено;
        
        Если Не ТолькоОшибки Тогда
    		// Ветка по документу
    		КореньДерева = ПроверкаРегистраторов_Результат.ПолучитьЭлементы();
    		НовыйУД = КореньДерева.Добавить();
            НовыйУД.Документ   = ВыборкаДок.ИмяДокумента;
    		НовыйУД.ЕстьВКонфе = ВыборкаДок.ЕстьВКонфе;
    		НовыйУД.ЕстьВФайле = ВыборкаДок.ЕстьВФайле;
    		ВеткаДерева = НовыйУД.ПолучитьЭлементы();
        КонецЕсли;
        
		ВыборкаРег = ВыборкаДок.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Пока ВыборкаРег.Следующий() Цикл
            
            Если Не ТолькоОшибки Тогда
    			// Вывод регистраторов
    			НоваяСД = ВеткаДерева.Добавить();
    			ЗаполнитьЗначенияСвойств(НоваяСД, ВыборкаРег);
    		КонецЕсли;	
            
            Если СравнитьСФайлом И ВыборкаРег.ЕстьВКонфе <> ВыборкаРег.ЕстьВФайле Тогда
                Если ТолькоОшибки Тогда
                    Если ВеткаДерева = Неопределено Тогда
                        // Ветка по документу
                		КореньДерева = ПроверкаРегистраторов_Результат.ПолучитьЭлементы();
                		НовыйУД = КореньДерева.Добавить();
                        НовыйУД.Документ   = ВыборкаДок.ИмяДокумента;
                		НовыйУД.ЕстьВКонфе = ВыборкаДок.ЕстьВКонфе;
                		НовыйУД.ЕстьВФайле = ВыборкаДок.ЕстьВФайле;
                		ВеткаДерева = НовыйУД.ПолучитьЭлементы();
                    КонецЕсли;
                    // Вывод регистраторов
                    НоваяСД = ВеткаДерева.Добавить();
                    ЗаполнитьЗначенияСвойств(НоваяСД, ВыборкаРег);
                КонецЕсли;
                ПроверкаРегистраторов_ЕстьОшибки = Истина;
                НоваяСД.ЕстьОшибки = Истина;
                НовыйУД.ЕстьОшибки = Истина;  				
            КонецЕсли;            
            
		КонецЦикла;		
	
	КонецЦикла; 

КонецПроцедуры // ЗаполнитьДеревоПроверкаРегистраторов()

&НаСервере
Функция РазобратьСтрокуСРазделителями(ИсходнаяСтрока,Разделитель)
	
	РезМассив = Новый Массив;
	
	Стр = ИсходнаяСтрока;
	КоличествоРазделителей = СтрЧислоВхождений(Стр,Разделитель);
	Для й = 1 По КоличествоРазделителей+1 Цикл
		
		ПозицияРазделителя = Найти(Стр,Разделитель);
		Если ПозицияРазделителя >0 Тогда
			ТекущееИмя = Лев(Стр,ПозицияРазделителя-1);
			Стр = Сред(Стр,ПозицияРазделителя+1);
		Иначе
			ТекущееИмя = СокрЛП(Стр);
		КонецЕсли; 
		РезМассив.Добавить(ТекущееИмя);
		
	КонецЦикла;
	
	Возврат РезМассив;
	
КонецФункции // РазобратьСтрокуСРазделителями()

#КонецОбласти

&НаСервере
Функция ТекущаяДатаНаСервере()
	
	Возврат ТекущаяДатаСеанса();
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы    = Форма.Элементы;
	Объект      = Форма.Объект;
	Тестировщик = (Форма.РежимРаботы = 0);
	Разработчик = (Форма.РежимРаботы = 1);
	Аналитик    = (Форма.РежимРаботы = 2);
	
	Элементы.ПроверкаСортировкиМетаданных.Видимость		 = Разработчик;
	Элементы.ПланыОбмена.Видимость 						 = Разработчик;
	Элементы.ГруппаРегистраторы.Видимость 				 = Разработчик;
	
	Элементы.РегистраторыХозрасчетный.Видимость 		 = Разработчик;
	Элементы.РегистраторыМеждународный.Видимость		 = Разработчик;
	
	Элементы.ПроверкаСоставныхТипов.Видимость 			 = Разработчик;
	Элементы.КонтрольныеСуммы.Видимость 				 = Разработчик;	
	Элементы.ТипыПВХ.Видимость 							 = Разработчик;
	Элементы.ГруппаУдалитьБлокировку.Видимость			 = Разработчик Или Тестировщик;
	Элементы.ОткрытиеФорм.Видимость						 = Разработчик Или Тестировщик;
	Элементы.ТестЗаписиОбъектов.Видимость				 = Разработчик Или Тестировщик;
	Элементы.ГруппаПанельСравненияКонфигураций.Видимость = Разработчик Или Тестировщик;
	Элементы.ЦентрУправленияИзменениями.Видимость		 = Разработчик Или Тестировщик;
	
	Элементы.РегистраторыМеждународный.Видимость 		 = Разработчик;	
	
	Элементы.СравнениеРегистраторов.Видимость 			 = Аналитик;
	
	Элементы.Аналитики.Видимость 			 			 = Разработчик ИЛИ Аналитик;

КонецПроцедуры // УправлениеФормой()

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();	
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.МетаданныеТекущие.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, "МетаданныеТекущие.Вид",
															ВидСравненияКомпоновкиДанных.Заполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, "МетаданныеТекущие.Ошибка",
															ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаШапкиОтчета);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.МетаданныеТекущие.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, "МетаданныеТекущие.Вид",
															ВидСравненияКомпоновкиДанных.Заполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, "МетаданныеТекущие.Ошибка",
															ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветОтрицательногоЧисла);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.МетаданныеТекущие.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, "МетаданныеТекущие.Вид",
															ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, "МетаданныеТекущие.Ошибка",
															ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.бит_ЦветФонаГруппыИтоги);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.МетаданныеОтсортированные.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, "МетаданныеТекущие.ЭтоБит",
															ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ЦветТочекАлгоритма);
	
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.МетаданныеОтсортированные.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, "МетаданныеОтсортированные.Вид",
															ВидСравненияКомпоновкиДанных.Заполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, "МетаданныеОтсортированные.Ошибка",
															ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаШапкиОтчета);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.МетаданныеОтсортированные.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, "МетаданныеОтсортированные.Вид",
															ВидСравненияКомпоновкиДанных.Заполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, "МетаданныеОтсортированные.Ошибка",
															ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветОтрицательногоЧисла);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.МетаданныеОтсортированные.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, "МетаданныеОтсортированные.Вид",
															ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, "МетаданныеОтсортированные.Ошибка",
															ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ЦветЗаголовкаСтатуса);

	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();	
	ПолеЭлемента 	  = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("НастройкиПодключений");	
	ОтборЭлементаУО = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлементаУО.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.НастройкиПодключений.ДанныеПрочитаны");
	ОтборЭлементаУО.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлементаУО.ПравоеЗначение = Истина;	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", Метаданные.ЭлементыСтиля.ВажнаяНадписьШрифт.Значение);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();	
	ПолеЭлемента 	  = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("НастройкиПодключений");	
	ОтборЭлементаУО = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлементаУО.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.НастройкиПодключений.НеАнализировать");
	ОтборЭлементаУО.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлементаУО.ПравоеЗначение = Истина;	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
		
КонецПроцедуры

&НаСервере
Функция ОбработкаОбъект()
	
	Возврат РеквизитФормыВЗначение("Объект");
	
КонецФункции

&НаСервере
Процедура ВосстановитьНастройки()
	
	КлючОбъекта  = "СравнениеМетаданныхКонфигураций";
    КлючНастроек = "НастройкиПодключений";
	
	СохраненныеНастройки = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта,КлючНастроек);
	Если СохраненныеНастройки <> Неопределено Тогда
		СохраненныеНастройки.ЗаполнитьЗначения(Ложь, "ДанныеПрочитаны");
		Объект.НастройкиПодключений.Загрузить(СохраненныеНастройки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	Если НЕ ЭтоАдресВременногоХранилища(АдресТаблицыДанных) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Необходимо считать данные конфигурации.'; 
						  	   |en = 'Необходимо считать данные конфигурации.'");
		Сообщение.Поле  = "ВыполнитьПроверку";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Результат = Новый ТабличныйДокумент;
	
	Схема     = ПолучитьИзВременногоХранилища(СхемаКомпоновкиДанных);
	Настройки = Компоновщик.ПолучитьНастройки();
	
	// Формирование макета, с помощью компоновщика макета.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	// Передача схемы, настроек и данных расшифровки в макет компоновки.
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(Схема, Настройки);
	
	// Внешние наборы данных
	ТаблицаМетаданных = ПолучитьИзВременногоХранилища(АдресТаблицыДанных);
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаМетаданных", ТаблицаМетаданных);
	
	// Выполнение компоновки с помощью процессора компоновки.
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных,, Истина);
                  
	// Вывод таблицы   	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.ОтображатьПроцентВывода = Истина;
	ПроцессорВывода.УстановитьДокумент(Результат); 	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ТекущийЭлемент = Элементы.Результат;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СводнаяТаблицаМетаданных(СтруктураТаблиц, МассивИД)
	
	Запрос   = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Для каждого ЭлементСтруктуры Из СтруктураТаблиц Цикл
		ИД            = ЭлементСтруктуры.Ключ;
		ТаблицаДанных = ЭлементСтруктуры.Значение;
		МассивИД.Добавить(ИД);
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТаблицаДанных.ВладелецСвойства КАК ВладелецСвойства,
		|	ТаблицаДанных.Значение КАК Значение,
		|	ТаблицаДанных.Свойство КАК Свойство,
		|	ТаблицаДанных.ТипОбъекта КАК ТипОбъекта,
		|	ТаблицаДанных.ХешКлюча КАК ХешКлюча
		|ПОМЕСТИТЬ ТаблицаДанныхПриемник
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ХешКлюча";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаДанныхПриемник", ИД);
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
		Запрос.Выполнить();
		
	КонецЦикла;
	
	ПервыйЭлемент = Истина;
	Для каждого ИД Из МассивИД Цикл
		Если ПервыйЭлемент Тогда
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	ТаблицаДанныхИсточник.ХешКлюча
			|ПОМЕСТИТЬ ДанныеКлючей
			|ИЗ
			|	ТаблицаДанныхИсточник КАК ТаблицаДанныхИсточник";
			ПервыйЭлемент = Ложь;
		Иначе
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ТаблицаДанныхИсточник.ХешКлюча
			|ИЗ
			|	ТаблицаДанныхИсточник КАК ТаблицаДанныхИсточник";
		КонецЕсли;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаДанныхИсточник", ИД);
	КонецЦикла;
	ТекстЗапроса = ТекстЗапроса + "
			|
			|;
			|///////////////////////////////////////////////////
			|";
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ
	|	ВЫБОР";
	Для каждого ИД Из МассивИД Цикл 
		ТекстЗапроса = ТекстЗапроса + "
		|		КОГДА НЕ " + ИД + ".ВладелецСвойства ЕСТЬ NULL
		|			ТОГДА " + ИД + ".ВладелецСвойства";
	КонецЦикла;
	ТекстЗапроса = ТекстЗапроса + "
	|	КОНЕЦ КАК ВладелецСвойства,
	|	ВЫБОР";
	Для каждого ИД Из МассивИД Цикл 
		ТекстЗапроса = ТекстЗапроса + "
		|		КОГДА НЕ " + ИД + ".Значение ЕСТЬ NULL
		|			ТОГДА " + ИД + ".Значение";
	КонецЦикла;
	ТекстЗапроса = ТекстЗапроса + "
	|	КОНЕЦ КАК Значение,
	|	ВЫБОР";
	Для каждого ИД Из МассивИД Цикл 
		ТекстЗапроса = ТекстЗапроса + "
		|		КОГДА НЕ " + ИД + ".Свойство ЕСТЬ NULL
		|			ТОГДА " + ИД + ".Свойство";
	КонецЦикла;
	ТекстЗапроса = ТекстЗапроса + "
	|	КОНЕЦ КАК Свойство,
	|	ВЫБОР";
	Для каждого ИД Из МассивИД Цикл 
		ТекстЗапроса = ТекстЗапроса + "
		|		КОГДА НЕ " + ИД + ".ТипОбъекта ЕСТЬ NULL
		|			ТОГДА " + ИД + ".ТипОбъекта";
	КонецЦикла;
	ТекстЗапроса = ТекстЗапроса + "
	|	КОНЕЦ КАК ТипОбъекта,";
	Для каждого ИД Из МассивИД Цикл
		ТекстЗапроса = ТекстЗапроса + "
		|	ВЫБОР
		|		КОГДА " + ИД + ".ХешКлюча ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК " + ПолеПризнакВхождения(ИД) + ",";
	КонецЦикла;
	ТекстЗапроса = ТекстЗапроса + "
	|	ДанныеКлючей.ХешКлюча КАК ХешКлюча
	|ИЗ
	|	ДанныеКлючей КАК ДанныеКлючей";
	Для каждого ИД Из МассивИД Цикл
		ТекстЗапроса = ТекстЗапроса + "
		|		ЛЕВОЕ СОЕДИНЕНИЕ " + ИД + " КАК " + ИД + "
		|		ПО ДанныеКлючей.ХешКлюча = " + ИД + ".ХешКлюча";
	КонецЦикла;
	
	Запрос.Текст     = ТекстЗапроса;
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();

	Возврат ТаблицаРезультат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолеПризнакВхождения(ИД)
	
	Возврат "ПрисутствуетВ" + ИД;
	
КонецФункции

&НаСервере
Функция НаименованиеИБ(ИД)
	
	Для каждого СтрокаПодключения Из Объект.НастройкиПодключений Цикл
		Если СтрокаПодключения.ИД = ИД Тогда
			Возврат СтрокаПодключения.Наименование;
		КонецЕсли;
	КонецЦикла;
	
	Возврат "<База не найдена>";
	
КонецФункции

&НаСервере
Процедура ПроверитьАналитикиНаСервере()
	
	ПроверкаАналитик_Результат.Очистить();
	ЕстьРасхождения = Ложь;
	
	Для каждого МетаданныеДокумента Из Метаданные.Документы Цикл
				
		ИмяДокумента = МетаданныеДокумента.Имя;
		Если Лев(ИмяДокумента, 4) = "бит_" Тогда
			Продолжить;	
		КонецЕсли;
		
		ИмяТипаСсылка = СтрШаблон("ДокументСсылка.%1", МетаданныеДокумента.Имя);
		ДокументТипСсылка = Тип(ИмяТипаСсылка);
		ИмяТипаОбъект = СтрШаблон("ДокументОбъект.%1", МетаданныеДокумента.Имя);
		ДокументТипОбъект = Тип(ИмяТипаОбъект);
		
		ВладелецАналитик     = Метаданные.ОпределяемыеТипы.бит_ВладелецДополнительныхАналитик.Тип.СодержитТип(ДокументТипСсылка);
		ИсточникПередЗаписью = Метаданные.ПодпискиНаСобытия.бит_ПередЗаписьюДокументаСАналитиками.Источник.СодержитТип(ДокументТипОбъект);
		ИсточникПриЗаписи    = Метаданные.ПодпискиНаСобытия.бит_ПриЗаписиДокументаСАналитиками.Источник.СодержитТип(ДокументТипОбъект);
		
		// Обработка "бит_РедактированиеДополнительныхАналитик".
		ИмяОбработкиРедактирования = "бит_РедактированиеДополнительныхАналитик";			
		Если Метаданные.Обработки.Найти(ИмяОбработкиРедактирования) <> Неопределено Тогда
			РедактированиеАналитик = Метаданные.Обработки[ИмяОбработкиРедактирования].Команды.Аналитики.ТипПараметраКоманды.СодержитТип(ДокументТипСсылка);		
		Иначе
			РедактированиеАналитик = Ложь;	
		КонецЕсли;
		// Документ "бит_ОтражениеФактаДДС".
		ИмяОтраженияФакта = "бит_ОтражениеФактаДДС";			
		Если Метаданные.Документы.Найти(ИмяОтраженияФакта) <> Неопределено Тогда
			ОтражениеФакта = Метаданные.Документы[ИмяОтраженияФакта].Команды.ОтражениеДДС.ТипПараметраКоманды.СодержитТип(ДокументТипСсылка);		
		Иначе
			ОтражениеФакта = Ложь;	
		КонецЕсли;
		
		// Обработка "бит_РезультатПроведения".
		ИмяОбработкиРезультат = "бит_РезультатПроведения";			
		Если Метаданные.Обработки.Найти(ИмяОбработкиРедактирования) <> Неопределено Тогда
			РезультатПроведения = Метаданные.Обработки[ИмяОбработкиРезультат].Команды.РезультатПроведения.ТипПараметраКоманды.СодержитТип(ДокументТипСсылка);		
		Иначе
			РезультатПроведения = Ложь;	
		КонецЕсли;
		// Обработка "бит_ДвиженияДокумента".
		ИмяОтчетаДвижений = "бит_ДвиженияДокумента";			
		Если Метаданные.Отчеты.Найти(ИмяОтчетаДвижений) <> Неопределено Тогда
			ОтчетДвижений = Метаданные.Отчеты[ИмяОтчетаДвижений].Команды.ОтчетПоДвижениям.ТипПараметраКоманды.СодержитТип(ДокументТипСсылка);		
		Иначе
			ОтчетДвижений = Ложь;	
		КонецЕсли;
				
		// Движения.
		ДвСЗТ = Метаданные.Документы[ИмяДокумента].Движения.Содержит(Метаданные.РегистрыСведений.бит_СоответствиеЗаписейТрансляции);
		ДвОпБ = Метаданные.Документы[ИмяДокумента].Движения.Содержит(Метаданные.РегистрыНакопления.бит_ОборотыПоБюджетам);
		ДвОпТ = Метаданные.Документы[ИмяДокумента].Движения.Содержит(Метаданные.РегистрыНакопления.бит_ОборотыПоТипамПроводок);
		ДвСОТ = Метаданные.Документы[ИмяДокумента].Движения.Содержит(Метаданные.РегистрыНакопления.бит_СоответствиеОборотовТрансляции);
		ДвБю  = Метаданные.Документы[ИмяДокумента].Движения.Содержит(Метаданные.РегистрыБухгалтерии.бит_Бюджетирование);
		ДвД1  = Метаданные.Документы[ИмяДокумента].Движения.Содержит(Метаданные.РегистрыБухгалтерии.бит_Дополнительный_1);
		ДвД2  = Метаданные.Документы[ИмяДокумента].Движения.Содержит(Метаданные.РегистрыБухгалтерии.бит_Дополнительный_2);
		ДвД3  = Метаданные.Документы[ИмяДокумента].Движения.Содержит(Метаданные.РегистрыБухгалтерии.бит_Дополнительный_3);
		ДвД4  = Метаданные.Документы[ИмяДокумента].Движения.Содержит(Метаданные.РегистрыБухгалтерии.бит_Дополнительный_4);
		ДвД5  = Метаданные.Документы[ИмяДокумента].Движения.Содержит(Метаданные.РегистрыБухгалтерии.бит_Дополнительный_5);
		ЕстьДвижения = ДвСЗТ ИЛИ ДвОпБ ИЛИ ДвОпТ ИЛИ ДвСОТ ИЛИ ДвБю ИЛИ ДвД1 ИЛИ ДвД2 ИЛИ ДвД3 ИЛИ ДвД4 ИЛИ ДвД5;
		ЕстьВсеДвижения = ДвСЗТ И ДвОпБ И ДвОпТ И ДвСОТ И ДвБю И ДвД1 И ДвД2 И ДвД3 И ДвД4 И ДвД5;
	
		// Проверки.
		ЕстьОшибкиПоДокументу = Ложь;		
		Если ВладелецАналитик ИЛИ ИсточникПередЗаписью ИЛИ ИсточникПриЗаписи 
			ИЛИ РедактированиеАналитик ИЛИ ОтражениеФакта ИЛИ РезультатПроведения 
			ИЛИ (ОтчетДвиженияДокумента И ОтчетДвижений) 
			ИЛИ (ПроверкаАналитикДвижения И ЕстьДвижения) Тогда		
			
			Если НЕ ВладелецАналитик Тогда
				// Обязательный определяемый тип для владельцев дополнительных аналитик.
				ЕстьОшибкиПоДокументу = Истина;
			ИначеЕсли бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
				Если НЕ ИсточникПередЗаписью ИЛИ НЕ ИсточникПриЗаписи Тогда
					// Подписки в БП должны быть включены.
					ЕстьОшибкиПоДокументу = Истина;
				КонецЕсли;
			ИначеЕсли бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда
				Если РедактированиеАналитик = ОтражениеФакта Тогда
					// Для некоторых документов вместо обработки редактирования используется документ отражения факта ДДС.
					ЕстьОшибкиПоДокументу = Истина;
				ИначеЕсли РедактированиеАналитик И (НЕ ИсточникПередЗаписью ИЛИ НЕ ИсточникПриЗаписи) Тогда
					// При использовании обработки должны быть включены подписки.
					ЕстьОшибкиПоДокументу = Истина;
				ИначеЕсли ОтражениеФакта И (ИсточникПередЗаписью ИЛИ ИсточникПриЗаписи) Тогда
					// При использовании документа подписки должны быть выключены.
					ЕстьОшибкиПоДокументу = Истина;					
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ РезультатПроведения Тогда
				ЕстьОшибкиПоДокументу = Истина;
			КонецЕсли;			
			Если ОтчетДвиженияДокумента И НЕ ОтчетДвижений Тогда
				ЕстьОшибкиПоДокументу = Истина;
			КонецЕсли;
			
			// Движения.
			Если ПроверкаАналитикДвижения И НЕ ЕстьВсеДвижения Тогда
				ЕстьОшибкиПоДокументу = Истина;			
			КонецЕсли;
						
			Если ЕстьОшибкиПоДокументу ИЛИ НЕ ТолькоРасхождения Тогда
			
				НоваяСтрока = ПроверкаАналитик_Результат.Добавить(); 
				НоваяСтрока.ИмяДокумента   = ИмяДокумента;
				НоваяСтрока.Представление  = МетаданныеДокумента.Представление();
				НоваяСтрока.Владелец       = ВладелецАналитик;
				НоваяСтрока.ПередЗаписью   = ИсточникПередЗаписью;
				НоваяСтрока.ПриЗаписи      = ИсточникПриЗаписи;
				НоваяСтрока.Редактирование = РедактированиеАналитик;
				НоваяСтрока.ОтражениеФакта = ОтражениеФакта;
				НоваяСтрока.РезультатПроведения = РезультатПроведения;
				НоваяСтрока.ОтчетДвижений 		= ОтчетДвижений;
				// Движения.
				НоваяСтрока.ДвиженияРегистрСведенийСоответствияЗаписейТрансляции = ДвСЗТ;
				НоваяСтрока.ДвиженияРегистрНакопленияОборотыПоБюджетам = ДвОпБ;
				НоваяСтрока.ДвиженияРегистрНакопленияОборотыПоТипамПроводок = ДвОпТ;
				НоваяСтрока.ДвиженияРегистрНакопленияСоответствиеОборотовТрансляции = ДвСОТ;
				НоваяСтрока.ДвиженияРегистрБухгалтерииБюджетирование = ДвБю;
				НоваяСтрока.ДвиженияРегистрБухгалтерииДополнительный_1 = ДвД1;
				НоваяСтрока.ДвиженияРегистрБухгалтерииДополнительный_2 = ДвД2;
				НоваяСтрока.ДвиженияРегистрБухгалтерииДополнительный_3 = ДвД3;
				НоваяСтрока.ДвиженияРегистрБухгалтерииДополнительный_4 = ДвД4;
				НоваяСтрока.ДвиженияРегистрБухгалтерииДополнительный_5 = ДвД5;
				
				Если ЕстьОшибкиПоДокументу Тогда			
					ЕстьРасхождения = Истина;
					НоваяСтрока.ЕстьРасхождения = Истина;			
				КонецЕсли;
			
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЦикла;
	
	Элементы.ДекорацияЕстьРасхождения.Видимость = ЕстьРасхождения;
	Элементы.ПроверкаАналитик_РезультатОтчетДвижений.Видимость = ОтчетДвиженияДокумента;
	Элементы.ПроверкаАналитик_РезультатГруппаДвижения.Видимость = ПроверкаАналитикДвижения;
		
КонецПроцедуры

#КонецОбласти
